20260824/20260824/Catalogs/РесурсныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РесурсныеСпецификации</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SB_ВиртуальныйУзел</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

20260824/20260824/CommonModules/SB_УправлениеПроизводствомВиртуальныеУзлы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SB_УправлениеПроизводствомВиртуальныеУзлы
//
// Пункт 3.6 ТЗ №1: «Учёт виртуальных узлов и вспомогательных операций».
//
// Виртуальный узел — строка полуфабриката ресурсной спецификации с признаком
// Справочник.РесурсныеСпецификации.МатериалыИУслуги.SB_ВиртуальныйУзел. Такой
// полуфабрикат не порождает отдельный этап производства: состав его производящей
// спецификации (материалы, возвратные отходы, работы, виды рабочих центров,
// операции) вливается в родительский этап. Признак проверяется на каждом уровне
// отдельно; вложенный узел без признака остаётся отдельным этапом.
//
// Количества не рассчитываются вручную: состав узла читается штатной
// РесурсныеСпецификации.ДанныеСпецификацииПоНоменклатуре, которой передаётся
// количество из строки узла, — нормы пересчитывает сама ERP.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Сворачивает виртуальные узлы в данных спецификации: состав производящих спецификаций
// строк с признаком SB_ВиртуальныйУзел вливается в таблицы родителя, сами строки-
// полуфабрикаты удаляются. Рекурсивно, с защитой от зацикливания.
//
// Параметры:
//  ДанныеСпецификации - Структура - см. РесурсныеСпецификации.ДанныеСпецификацииКонструктор.
//                       Изменяется по месту.
//  Изделие            - СтрокаТаблицыЗначений, Структура - контекст (распоряжение,
//                       подразделение, даты) для дочитывания состава узла.
//  ПараметрыВыборки   - Структура - см. РесурсныеСпецификации.ПараметрыВыборкиДанных;
//                       передаётся вызывающим, чтобы состав узла читался с теми же
//                       настройками, что и состав родителя.
//
Процедура СвернутьВиртуальныеУзлы(ДанныеСпецификации, Изделие, ПараметрыВыборки) Экспорт

	Если ДанныеСпецификации = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Вызывающий берёт данные спецификации из кэша и меняет по месту, поэтому процедура
	// может быть вызвана для одного объекта повторно — защита от двойного вливания.
	Если ДанныеСпецификации.Свойство("SB_ВиртуальныеУзлыСвернуты") Тогда
		Возврат;
	КонецЕсли;
	ДанныеСпецификации.Вставить("SB_ВиртуальныеУзлыСвернуты", Истина);

	ПройденныеСпецификации = Новый Массив;
	СвернутьСЗащитой(ДанныеСпецификации, Изделие, ПараметрыВыборки, ПройденныеСпецификации);

КонецПроцедуры

// Исключает вспомогательные операции (признак ТехнологическиеОперации.SB_Вспомогательная-
// Операция) из таблицы операций.
//
// Параметры:
//  ТаблицаОпераций    - ТаблицаЗначений - должна содержать колонку с тех. операцией.
//  ИмяКолонкиОперации - Строка          - имя колонки со ссылкой на ТехнологическуюОперацию.
//
Процедура УдалитьВспомогательныеОперации(ТаблицаОпераций, ИмяКолонкиОперации = "ТехнологическаяОперация") Экспорт

	Если ТаблицаОпераций = Неопределено ИЛИ ТаблицаОпераций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Признаки = ПризнакиВспомогательныхОпераций(ТаблицаОпераций.ВыгрузитьКолонку(ИмяКолонкиОперации));

	КоличествоСтрок = ТаблицаОпераций.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Строка = ТаблицаОпераций[КоличествоСтрок - Инд];
		Если Признаки.Получить(Строка[ИмяКолонкиОперации]) = Истина Тогда
			ТаблицаОпераций.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Дополняет список операций этапа операциями виртуальных узлов — для очереди производственных
// операций (РМ «Выполнение операций»). Очередь строится перечитыванием спецификации по этапу,
// минуя состав документа-этапа, поэтому операции узлов туда не попадают. Читаем состав этапа со
// сворачиванием и добавляем недостающие операции узлов перед операциями родителя, со сквозной
// перенумерацией и уникальными идентификаторами (регистр очереди ключуется в т.ч. по
// ИдентификаторОперации).
//
// Параметры:
//  Операции   - ТаблицаЗначений - см. Справочники.ТехнологическиеОперации.ТаблицаОперацииКонструктор.
//               Изменяется по месту.
//  ДанныеЭтапа - Структура - см. Документы.ЭтапПроизводства2_2.ДанныеДляРасчетаОчередиОпераций.
//
Процедура ДополнитьОперацииУзлов(Операции, ДанныеЭтапа) Экспорт

	Если Операции = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТехнологическийПроцесс = Неопределено;
	Если Не ДанныеЭтапа.Свойство("ТехнологическийПроцесс", ТехнологическийПроцесс)
		ИЛИ ТипЗнч(ТехнологическийПроцесс) <> Тип("СправочникСсылка.РесурсныеСпецификации") Тогда
		Возврат;
	КонецЕсли;

	ДанныеСпец = ПрочитатьСоставЭтапаСоСворачиванием(ДанныеЭтапа);
	ОперацииСвернутые = Неопределено;
	Если ДанныеСпец = Неопределено
		ИЛИ Не ДанныеСпец.Свойство("Операции", ОперацииСвернутые)
		ИЛИ ОперацииСвернутые = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Операции родителя уже в списке — по ссылке на операцию их не дублируем.
	ОперацииРодителя = Новый Соответствие;
	Для Каждого Строка Из Операции Цикл
		ОперацииРодителя.Вставить(Строка.Операция, Истина);
	КонецЦикла;

	СледИдентификатор = МаксИдентификаторОперации(Операции) + 1;
	ДобавленоУзлов = 0;
	Индекс = 0;
	Для Каждого СтрокаУзла Из ОперацииСвернутые Цикл

		Если ОперацииРодителя.Получить(СтрокаУзла.Операция) = Истина Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Операции.Вставить(Индекс);
		Индекс = Индекс + 1;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУзла);
		НоваяСтрока.ИдентификаторОперации = СледИдентификатор;
		СледИдентификатор = СледИдентификатор + 1;
		ДобавленоУзлов = ДобавленоУзлов + 1;

	КонецЦикла;

	Если ДобавленоУзлов > 0 Тогда
		ПеренумероватьОперации(Операции);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Читает состав этапа спецификации (операции + материалы) штатной механикой ERP и сворачивает
// в нём виртуальные узлы. Возвращает структуру данных спецификации либо Неопределено.
Функция ПрочитатьСоставЭтапаСоСворачиванием(ДанныеЭтапа)

	ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();
	ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, ДанныеЭтапа);
	ДанныеПоНоменклатуре.Спецификация = ДанныеЭтапа.ТехнологическийПроцесс;

	Если ДанныеЭтапа.Свойство("КоличествоУпаковокПлан") И ДанныеЭтапа.Свойство("КоэффициентУпаковки") Тогда
		Количество = ДанныеЭтапа.КоличествоУпаковокПлан * ДанныеЭтапа.КоэффициентУпаковки;
		Если Количество <> 0 Тогда
			ДанныеПоНоменклатуре.Количество = Количество;
		КонецЕсли;
	КонецЕсли;

	ПараметрыВыборки = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных("Операции,МатериалыИУслуги");

	Попытка
		ДанныеСпец = Справочники.РесурсныеСпецификации.ДанныеСпецификацииПоНоменклатуре(
			ДанныеПоНоменклатуре,
			ПараметрыВыборки,
			Новый Структура("Этап", ДанныеЭтапа.ЭтапСпецификации));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	СвернутьВиртуальныеУзлы(ДанныеСпец, ДанныеЭтапа, ПараметрыВыборки);

	Возврат ДанныеСпец;

КонецФункции

// Максимальный числовой идентификатор операции в таблице (для выдачи новых уникальных).
Функция МаксИдентификаторОперации(Операции)

	Макс = 0;
	Для Каждого Строка Из Операции Цикл
		Значение = ПолеИлиНеопределено(Строка, "ИдентификаторОперации");
		Если ТипЗнч(Значение) = Тип("Число") И Значение > Макс Тогда
			Макс = Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат Макс;

КонецФункции

// Сквозная перенумерация операций этапа: НомерОперации по порядку строк, цепочка
// НомерСледующейОперации — на следующую (0 у последней). Порядок строк уже задан вливанием
// (операции узлов идут первыми). Разветвлённые маршруты линеаризуются.
Процедура ПеренумероватьОперации(Операции)

	Всего = Операции.Количество();
	Для Индекс = 0 По Всего - 1 Цикл

		Строка = Операции[Индекс];
		Если Индекс + 1 < Всего Тогда
			НомерСледующий = Индекс + 2;
		Иначе
			НомерСледующий = 0;
		КонецЕсли;

		Попытка
			Строка.НомерОперации = Индекс + 1;
			Строка.НомерСледующейОперации = НомерСледующий;
		Исключение
			// колонок нумерации нет — пропускаем
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

// Соответствие «ТехнологическаяОперация -> Признак вспомогательной» по массиву операций.
Функция ПризнакиВспомогательныхОпераций(МассивОпераций)

	Результат = Новый Соответствие;
	Если МассивОпераций = Неопределено ИЛИ МассивОпераций.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОпераций", МассивОпераций);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТехнологическиеОперации.Ссылка КАК Ссылка,
	|	ТехнологическиеОперации.SB_ВспомогательнаяОперация КАК Вспомогательная
	|ИЗ
	|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	|ГДЕ
	|	ТехнологическиеОперации.Ссылка В (&МассивОпераций)";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Булево(Выборка.Вспомогательная));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура СвернутьСЗащитой(ДанныеСпецификации, Изделие, ПараметрыВыборки, ПройденныеСпецификации)

	Спецификация = Неопределено;
	ДанныеСпецификации.Свойство("Спецификация", Спецификация);

	МатериалыИУслуги = Неопределено;
	Если Не ДанныеСпецификации.Свойство("МатериалыИУслуги", МатериалыИУслуги)
		ИЛИ МатериалыИУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Спецификация) Тогда
		Если ПройденныеСпецификации.Найти(Спецификация) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПройденныеСпецификации.Добавить(Спецификация);
	КонецЕсли;

	КлючиВиртуальных = КлючиВиртуальныхУзлов(Спецификация);
	Если КлючиВиртуальных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтрокиКУдалению = Новый Массив;
	СовпалоПоКлючу = 0;

	Для Каждого СтрокаУзел Из МатериалыИУслуги Цикл

		Если КлючиВиртуальных.Получить(СтрокаУзел.КлючСвязи) <> Истина Тогда
			Продолжить;
		КонецЕсли;
		СовпалоПоКлючу = СовпалоПоКлючу + 1;

		// Строка помечена, но производить не по чему — оставляем как обычный материал.
		Если Не СтрокаУзел.ПроизводитсяВПроцессе ИЛИ Не ЗначениеЗаполнено(СтрокаУзел.Спецификация) Тогда
			Продолжить;
		КонецЕсли;

		ДанныеУзла = ДанныеСпецификацииУзла(СтрокаУзел, Изделие, ПараметрыВыборки);
		Если ДанныеУзла = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		// Вложенные виртуальные узлы сворачиваем рекурсивно; без признака остаются партиями.
		СвернутьСЗащитой(ДанныеУзла, Изделие, ПараметрыВыборки, ПройденныеСпецификации);

		ВлитьСоставУзла(ДанныеСпецификации, ДанныеУзла, СтрокаУзел);
		СтрокиКУдалению.Добавить(СтрокаУзел);

	КонецЦикла;

	Для Каждого Строка Из СтрокиКУдалению Цикл
		МатериалыИУслуги.Удалить(Строка);
	КонецЦикла;

	Если ЗначениеЗаполнено(Спецификация) Тогда
		ПройденныеСпецификации.Удалить(ПройденныеСпецификации.Найти(Спецификация));
	КонецЕсли;

КонецПроцедуры

// Ключи связи строк МатериалыИУслуги спецификации, помеченных признаком «Виртуальный узел».
// Признак живёт в НСИ (данные спецификации собираются запросом с фиксированным набором
// полей), поэтому связка строк идёт по КлючСвязи.
Функция КлючиВиртуальныхУзлов(Спецификация)

	Ключи = Новый Соответствие;
	Если Не ЗначениеЗаполнено(Спецификация) Тогда
		Возврат Ключи;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МатериалыИУслуги.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК МатериалыИУслуги
	|ГДЕ
	|	МатериалыИУслуги.Ссылка = &Спецификация
	|	И МатериалыИУслуги.SB_ВиртуальныйУзел";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключи.Вставить(Выборка.КлючСвязи, Истина);
	КонецЦикла;

	Возврат Ключи;

КонецФункции

// Состав производящей спецификации узла, пересчитанный штатной механикой ERP на
// количество, которое требуется в родительской строке.
Функция ДанныеСпецификацииУзла(СтрокаУзел, Изделие, ПараметрыВыборки)

	ДанныеПоНоменклатуре = Справочники.РесурсныеСпецификации.ДанныеПоНоменклатуреРасширенный();

	// Распоряжение, подразделение, направление, даты — из родительского изделия:
	// узел производится в его контексте.
	ЗаполнитьЗначенияСвойств(ДанныеПоНоменклатуре, Изделие);

	ДанныеПоНоменклатуре.Номенклатура   = СтрокаУзел.Номенклатура;
	ДанныеПоНоменклатуре.Характеристика = СтрокаУзел.Характеристика;
	ДанныеПоНоменклатуре.Спецификация   = СтрокаУзел.Спецификация;

	// Количество узла в родителе уже пересчитано ERP на партию выпуска; отдавая его как
	// количество узла, получаем нормы его состава арифметикой самой ERP.
	ДанныеПоНоменклатуре.Количество = СтрокаУзел.Количество;

	Попытка
		Возврат Справочники.РесурсныеСпецификации.ДанныеСпецификацииПоНоменклатуре(
			ДанныеПоНоменклатуре, ПараметрыВыборки);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Вливает состав узла в таблицы родителя. Выходные изделия узла не вливаются: выходное
// изделие узла — это сам полуфабрикат, которого мы и лишаем отдельного этапа.
Процедура ВлитьСоставУзла(ДанныеРодителя, ДанныеУзла, СтрокаУзел)

	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "МатериалыИУслуги",  СтрокаУзел);
	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "ВозвратныеОтходы",  СтрокаУзел);
	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "ВыполняемыеРаботы", СтрокаУзел);

	// Виды рабочих центров загружаются только в состав этапа (в расчёт структуры заказа —
	// нет); если таблицы нет, ВлитьТаблицу просто выйдет. Эталонную строку ВРЦ родителя
	// считаем до вливания — по ней выравнивается время работы влитых ВРЦ (см. ЭталоннаяСтрокаВРЦ).
	ЭталонВРЦ = ЭталоннаяСтрокаВРЦ(ДанныеРодителя, СтрокаУзел);
	// Одинаковые виды рабочих центров группируем в одну строку с суммарным временем работы,
	// а не дописываем дубли: иначе этап получает несколько строк одного ВРЦ и требует заполнить
	// поле «Загрузка нескольких видов рабочих центров».
	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "ВидыРабочихЦентров",               СтрокаУзел, Ложь, ЭталонВРЦ, Истина);
	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "АльтернативныеВидыРабочихЦентров", СтрокаУзел, Ложь, ЭталонВРЦ);

	// Трудозатраты — единственная таблица, где порядок строк несёт смысл: он задаёт
	// последовательность операций этапа (ERP берёт порядок таблицы, а не НомерСтроки).
	// По ТЗ операции узла идут перед операциями родителя, поэтому вставляем в начало.
	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "Трудозатраты", СтрокаУзел, Истина);

	// Операции — источник очереди РМ «Выполнение операций». Присутствуют не всегда (только
	// когда данные читались с ПереченьДанных «Операции»); порядок как у трудозатрат — узел вперёд.
	ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, "Операции", СтрокаУзел, Истина);

КонецПроцедуры

// ВНачало        - Булево - вставлять строки узла в начало таблицы родителя (сохраняя их
//                  взаимный порядок) вместо дописывания в конец.
// ЭталонВРЦ       - СтрокаТаблицыЗначений, Неопределено - строка ВРЦ родителя, по которой
//                  выравнивается время работы влитых видов рабочих центров.
// ГруппироватьВРЦ - Булево - одинаковый вид рабочего центра (тот же вид + вариант наладки на
//                  том же этапе) не дописывать отдельной строкой, а суммировать его время
//                  работы в уже имеющуюся строку родителя.
Процедура ВлитьТаблицу(ДанныеРодителя, ДанныеУзла, ИмяТаблицы, СтрокаУзел, ВНачало = Ложь, ЭталонВРЦ = Неопределено, ГруппироватьВРЦ = Ложь)

	ТаблицаУзла = Неопределено;
	Если Не ДанныеУзла.Свойство(ИмяТаблицы, ТаблицаУзла)
		ИЛИ ТаблицаУзла = Неопределено
		ИЛИ ТаблицаУзла.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТаблицаРодителя = Неопределено;
	Если Не ДанныеРодителя.Свойство(ИмяТаблицы, ТаблицаРодителя)
		ИЛИ ТаблицаРодителя = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Индекс = 0;
	Для Каждого СтрокаИсточник Из ТаблицаУзла Цикл

		// Одинаковый ВРЦ уже есть в этапе — суммируем время в него, новую строку не создаём.
		Если ГруппироватьВРЦ Тогда
			СтрокаГруппы = НайтиСтрокуВРЦ(ТаблицаРодителя, СтрокаИсточник, СтрокаУзел);
			Если СтрокаГруппы <> Неопределено Тогда
				ДобавитьВремяВРЦ(СтрокаГруппы, СтрокаИсточник);
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Если ВНачало Тогда
			НоваяСтрока = ТаблицаРодителя.Вставить(Индекс);
			Индекс = Индекс + 1;
		Иначе
			НоваяСтрока = ТаблицаРодителя.Добавить();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);

		// Строки узла несут этап своей спецификации — переназначаем на этап, где потреблялся узел.
		ПеренестиНаЭтапУзла(НоваяСтрока, СтрокаУзел);

		Если ЭталонВРЦ <> Неопределено Тогда
			ПеренестиПоле(НоваяСтрока, ЭталонВРЦ, "ВремяРаботы");
			ПеренестиПоле(НоваяСтрока, ЭталонВРЦ, "ЕдиницаИзмерения");
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Строка ВРЦ родителя того же вида и того же варианта наладки на том же этапе — чтобы
// сгруппировать одинаковый вид рабочего центра, а не плодить дубли. КлючСвязи в ключ не входит:
// он у каждой строки спецификации свой, иначе одинаковые ВРЦ не сгруппировались бы.
Функция НайтиСтрокуВРЦ(ТаблицаРодителя, СтрокаИсточник, СтрокаУзел)

	ВидИсточник     = ПолеИлиНеопределено(СтрокаИсточник, "ВидРабочегоЦентра");
	ВариантИсточник = ПолеИлиНеопределено(СтрокаИсточник, "ВариантНаладки");

	// Этап сравниваем, только если он есть в таблице ВРЦ (в составе этапа его может не быть).
	СравниватьЭтап = ПолеЕсть(СтрокаИсточник, "Этап");
	ЭтапЦель = Неопределено;
	Если СравниватьЭтап Тогда
		ЭтапЦель = ПолеИлиНеопределено(СтрокаУзел, "Этап");
	КонецЕсли;

	Для Каждого Строка Из ТаблицаРодителя Цикл
		Если ПолеИлиНеопределено(Строка, "ВидРабочегоЦентра") <> ВидИсточник Тогда
			Продолжить;
		КонецЕсли;
		Если ПолеИлиНеопределено(Строка, "ВариантНаладки") <> ВариантИсточник Тогда
			Продолжить;
		КонецЕсли;
		Если СравниватьЭтап И ПолеИлиНеопределено(Строка, "Этап") <> ЭтапЦель Тогда
			Продолжить;
		КонецЕсли;
		Возврат Строка;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Суммирует время работы группируемого вида рабочего центра в найденную строку родителя.
Процедура ДобавитьВремяВРЦ(СтрокаГруппы, СтрокаИсточник)

	СложитьПоле(СтрокаГруппы, СтрокаИсточник, "ВремяРаботы");
	СложитьПоле(СтрокаГруппы, СтрокаИсточник, "ВремяРаботыНорматив");

КонецПроцедуры

Функция ПолеЕсть(Строка, ИмяПоля)

	Попытка
		Значение = Строка[ИмяПоля];
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ПолеИлиНеопределено(Строка, ИмяПоля)

	Попытка
		Возврат Строка[ИмяПоля];
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Процедура СложитьПоле(Приемник, Источник, ИмяПоля)

	Слагаемое = ПолеИлиНеопределено(Источник, ИмяПоля);
	Текущее   = ПолеИлиНеопределено(Приемник, ИмяПоля);
	Если Слагаемое = Неопределено ИЛИ Текущее = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Приемник[ИмяПоля] = Текущее + Слагаемое;
	Исключение
		// поле не числовое или только для чтения — пропускаем
	КонецПопытки;

КонецПроцедуры

// Строка ВРЦ родителя, по которой выравнивается время работы влитых видов рабочих центров.
// Выравниваем только когда этап работает «Одновременно»: ERP требует у всех ВРЦ такого этапа
// одинаковое время работы, иначе этап зависает в статусе «Формируется». При «Последовательно»
// разные времена законны — возвращаем Неопределено, выравнивание не нужно.
Функция ЭталоннаяСтрокаВРЦ(ДанныеРодителя, СтрокаУзел)

	ЭтапУзла = Неопределено;
	Попытка
		ЭтапУзла = СтрокаУзел.Этап;
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Если Не ЭтапРаботаетОдновременно(ДанныеРодителя, ЭтапУзла) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ВидыРабочихЦентров = Неопределено;
	Если Не ДанныеРодителя.Свойство("ВидыРабочихЦентров", ВидыРабочихЦентров)
		ИЛИ ВидыРабочихЦентров = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Для Каждого Строка Из ВидыРабочихЦентров Цикл
		Попытка
			Если Строка.Этап <> ЭтапУзла Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			// В таблице нет колонки Этап — берём первую строку как эталон.
		КонецПопытки;
		Возврат Строка;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ЭтапРаботаетОдновременно(ДанныеРодителя, ЭтапУзла)

	Этапы = Неопределено;
	Если Не ДанныеРодителя.Свойство("Этапы", Этапы) ИЛИ Этапы = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
		СтрокаЭтапа = Этапы.Найти(ЭтапУзла, "Этап");
		Если СтрокаЭтапа = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат СтрокаЭтапа.ПорядокРаботыВидовРабочихЦентров
			= Перечисления.ПорядокРаботыВидовРабочихЦентров.Одновременно;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Процедура ПеренестиНаЭтапУзла(НоваяСтрока, СтрокаУзел)

	ПеренестиПоле(НоваяСтрока, СтрокаУзел, "Этап");
	ПеренестиПоле(НоваяСтрока, СтрокаУзел, "ПодразделениеЭтапа");
	ПеренестиПоле(НоваяСтрока, СтрокаУзел, "НомерЭтапа");

КонецПроцедуры

Процедура ПеренестиПоле(Приемник, Источник, ИмяПоля)

	Попытка
		Значение = Источник[ИмяПоля];
	Исключение
		Возврат; // в исходной строке такого поля нет
	КонецПопытки;

	Попытка
		Приемник[ИмяПоля] = Значение;
	Исключение
		Возврат; // в целевой таблице нет такой колонки
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
